package com.deloitte.services.srpmp.common.exception;

import com.deloitte.platform.common.core.common.IErrorType;
import lombok.Getter;

@Getter
public enum SrpmsErrorType implements IErrorType {


    // 强调！！！！！强调！！！！！强调！！！！！强调！！！！！强调！！！！！
    // 大家业务里产生的代码，请从84010001开始，到84018999结束。
    // 84019000到84019999之间的CODE已经预定为创新工程输入检查错误代码，请大家不要使用。
    // 强调！！！！！强调！！！！！强调！！！！！强调！！！！！强调！！！！！

    // 错误CODE说明，请务必阅读
    // 科研错误CODE已8401开头，后四位为序列号，其中84019XXX为前端传入参数不通过。目前为创新工程的输入检查的错误代码，如果大家要使用此CODE段，请与创新工程后端开发联系。
    // 进一步细分：84019000到84019099为申请书保存和提交的时候都进行的检查的错误代码，比如数值检查不通过
    // 84019100到84019199为预算书保存和提交的时候都进行的检查的错误代码，比如数值检查不通过
    // 84019200到84019299为任务书保存和提交的时候都进行的检查的错误代码，比如数值检查不通过
    // 84019300到84019399为提交时各种数据之间复杂检查不通过
    // 84019400到84019499暂时预留
    // 84019500到84019599开始的代码都是申请书提交的时候需要检查的必须输入的项目没有输入时的错误代码
    // 84019600到84019699开始的代码都是预算书提交的时候需要检查的必须输入的项目没有输入时的错误代码
    // 84019700到84019799开始的代码都是任务书提交的时候需要检查的必须输入的项目没有输入时的错误代码
    // 84019800到84019999暂时预留

    //系统异常（主要是框架层面异常）
    SYS_DICT_CODE_ERROR("84010001", "数据字典类型不存在"),
    PROJECT_HAS_SUBMIT("84010002","当前申请书已提交，请勿重复提交"),
    BUDGET_NOT_COMPLETE("84010003","预算书未填写完毕，请填写完预算书过后再进行提交"),
    APPLY_BOOK_NOT_COMPLETE("84010004","申请书未填写完毕，请填写完申请书过后再进行提交"),
    PROJECT_STATUS_NG("84010005","当前项目状态不允许此操作"),
    APPLY_HAVE_SUBMITTED("84010006","申请书已经提交不能再修改。"),

    OTHER("84010007","其他"),
    TASK_NOT_COMPLETE("84010008","任务书未填写完毕，请填写完任务书过后再进行提交"),
    TASK_BUDGET_NOT_COMPLETE("84010009","任务预算书未填写完毕，请填写完任务预算书过后再进行提交"),
    PUBLICED_CAN_SUBMITTED("84010010","只有已公示的申请书才可以提交任务书。"),
    PROJECT_NOT_FOUND("84010011","没有找到对应的项目。"),
    EXPORT_EXCEL_FAIL("84011001","导出excel数据失败。"),
    ADD_NOT_VALID("84011002", "保存数据必填字段或者重复校验不通过"),
    TASK_HAVE_SUBMITTED("84010013","任务书已经提交不能再修改。"),
    IMPORT_EXCEL_ERROR("84010014","导入excel文件不符合，请重新选择文件。"),
    NO_ELEMENTS("84010015","未解析到数据。"),
    FILE_NO_FOUND("84010016","文件不存在。"),
    TRANSFER_HTML_ERROR("84010017","转换文件错误。"),
    PARAM_NULL("84010018","参数为空。"),
    APPLY_HAVE_INSERT("84010019","申请书已经保存，不能重复执行保存操作。"),
    TASK_HAVE_INSERT("84010020","任务书已经保存，不能重复执行保存操作。"),
    PROJECT_ID_NULL("84010021","项目编号为空"),
    UPDATE_HAVE_SUBMITTED("84010022","变更记录已经提交不能执行修改操作"),
    UPDATE_NO_SUBMITTED("84010023","变更记录未审批之前不能重复执行变更记录操作"),
    AUDIT_STATUS_ERROR("84010024","审批状态异常"),
    SAME_PROJECT_TYPE("84010025","请选择同一项目类型的项目"),
    UPDATE_SELF_PROJECT("84010026","请选择自己提交的项目变更进行操作"),
    UPDATE_SAVE_BEFORE_SUBMIT("84010027","请先保存再执行提交操作"),
    UPDATE_NO_DATA("84010028","没有查询到项目变更数据"),
    IMPORT_FILE_ERROR("84010029","文件错误，请重新选择文件。"),
    ACCEPT_NO_DATA("84010030","没有查询到项目验收报告数据"),
    ACCEPT_HAVE_SUBMITTED("84010031","项目验收已经提交不能执行修改操作"),
    RESULT_NO_DATA("84010032","没有查询到成果管理数据"),
    RESULT_HAVE_SUBMITTED("84010033","成果管理已经提交不能执行修改操作"),
    RESULT_TRANS_NO_DATA("84010034","没有查询到成果转化数据"),
    EVA_BASE_NOT_COMPLETE("84010035","请保存考评信息表"),
    EVA_PROJ_NOT_COMPLETE("84010036","请保存考评自评报告"),
    SYS_DICT_VALUE_EXISTS("84010037","字典名称不能录入相同的数据，请重新录入"),
    ACCEPT_NO_ADD_DATA("84010038","此项目已执行验收操作，不允许重复验收"),
    PROCESS_SUBMIT_NOT_DATA("84010039","没有查询到审批提交的数据"),
    PROCESS_VOUCHER_DATA("84010040","没有查询到审批单据数据"),
    BUDGET_YEAR_DATA("84010041","没有查询到预算申请数据"),
    
    
    BPM_NOT_AVAIABLE("84010042","流程服务不可用，请联系系统管理员，或稍后再试。"),

    ADMIN_NO_PROJECT_TYPE("84010601","该管理员没有任何项目类型的权限。"),
    UPDATE_RECORD_AREADY_EXIST("84010600","该项目的此种类型的变更有还没有结束的记录。"),
    NOT_IN_BUDGET_ACTION_DATE("84010600","不在项目预算执行周期内，不能进行预算变更。"),
    // ------------------------创新工程输入检查错误定义   开始----------------------------------------
    // 此部分代码由GeneratorInputErrorType自动生成 开始
    INPUT_ERROR_9000 ("84019000","申请书：拟申请经费必须为0到10000000之间的数字"),
    INPUT_ERROR_9001 ("84019001","申请书：拟申请岗位数必须为0到1000000之间的整数"),
    INPUT_ERROR_9002 ("84019002","申请书：项目首席专家每年工作时间必须为1到12之间的数字"),
    INPUT_ERROR_9003 ("84019003","申请书：项目共同首席专家每年工作时间必须为0到12之间的数字"),
    INPUT_ERROR_9004 ("84019004","申请书：团队组成情况-任务分解的人数必须为0到1000000之间的整数"),
    INPUT_ERROR_9005 ("84019005","申请书：团队组成情况-任务分解的经费分配（万元）必须为0到1000000之间的数字"),
    INPUT_ERROR_9006 ("84019006","申请书：经费与预算的创新工程费必须为0到10000000之间的数字"),
    INPUT_ERROR_9007 ("84019007","申请书：经费与预算的单位自筹经费必须为0到10000000之间的数字"),
    INPUT_ERROR_9008 ("84019008","申请书：经费与预算的其他经费必须为0到10000000之间的数字"),
    INPUT_ERROR_9009 ("84019009","申请书：主要参与人员的每年工作时间必须为0到12之间的数字"),
    INPUT_ERROR_9100 ("84019100","预算书：项目参加人员的流动人员和临时聘用人员合计必须为0到1000000之间的整数"),
    INPUT_ERROR_9101 ("84019101","预算书：设备费—购置/试制设备预算明细表的单价（元/台）必须为0到10000000之间的数字"),
    INPUT_ERROR_9102 ("84019102","预算书：设备费—购置/试制设备预算明细表的数量必须为0到1000000之间的数字"),
    INPUT_ERROR_9103 ("84019103","预算书：设备费—购置/试制设备预算明细表的金额（万元）必须为0到10000000之间的数字"),
    INPUT_ERROR_9104 ("84019104","预算书：测试化验加工费预算明细表的单价（元/单位数量）必须为0到10000000之间的数字"),
    INPUT_ERROR_9105 ("84019105","预算书：测试化验加工费预算明细表的数量必须为0到1000000之间的数字"),
    INPUT_ERROR_9106 ("84019106","预算书：测试化验加工费预算明细表的金额（万元）必须为0到10000000之间的数字"),
    INPUT_ERROR_9107 ("84019107","预算书：主要参与人员的每年工作时间必须为0到12之间的数字"),
    INPUT_ERROR_9108 ("84019108","预算书：绩效目标申报表的资金总额必须为0到10000000之间的数字"),
    INPUT_ERROR_9109 ("84019109","预算书：绩效目标申报表的当年财务拨款必须为0到10000000之间的数字"),
    INPUT_ERROR_9110 ("84019110","预算书：绩效目标申报表的当年其他资金必须为0到10000000之间的数字"),
    INPUT_ERROR_9111 ("84019111","预算书：绩效目标申报表的单位自筹经费必须为0到10000000之间的数字"),
    INPUT_ERROR_9200 ("84019200","项目首席专家每年工作时间必须为9到12之间的数字"),
    INPUT_ERROR_9201 ("84019201","任务书：项目共同首席专家每年工作时间必须为0到12之间的数字"),
    INPUT_ERROR_9202 ("84019202","任务书：国家合作单位信息的参与人数必须为0到1000000之间的整数"),
    INPUT_ERROR_9203 ("84019203","任务书：任务分解的经费分配比例必须为0到99之间的数字"),
    INPUT_ERROR_9204 ("84019204","任务书：主要参与人员的每年工作时间必须为0到12之间的数字"),
    INPUT_ERROR_9500 ("84019500","出现下列的错误"),
    // 此部分代码由GeneratorInputErrorType自动生成 结束

    // 此部分代码由手工填写 开始
    INPUT_ERROR_9300 ("84019300","申请书：【项目任务分解情况和各任务之间的逻辑关系图示】中的负责人不在项目人员列表"),
    INPUT_ERROR_9301 ("84019301","申请书：【项目任务分解情况和各任务之间的逻辑关系图示】中的经费分配比例总和不为100%<br><br>申请书：【项目任务分解情况和各任务之间的逻辑关系图示】中的经费分配比例总和不为100%<br><br>申请书：【项目任务分解情况和各任务之间的逻辑关系图示】中的经费分配比例总和不为100%<br><br>申请书：【项目任务分解情况和各任务之间的逻辑关系图示】中的经费分配比例总和不为100%<br><br>申请书：【项目任务分解情况和各任务之间的逻辑关系图示】中的经费分配比例总和不为100%<br><br>申请书：【项目任务分解情况和各任务之间的逻辑关系图示】中的经费分配比例总和不为100%<br><br>申请书：【项目任务分解情况和各任务之间的逻辑关系图示】中的经费分配比例总和不为100%<br><br>申请书：【项目任务分解情况和各任务之间的逻辑关系图示】中的经费分配比例总和不为100%<br><br>申请书：【项目任务分解情况和各任务之间的逻辑关系图示】中的经费分配比例总和不为100%<br><br>申请书：【项目任务分解情况和各任务之间的逻辑关系图示】中的经费分配比例总和不为100%<br><br>申请书：【项目任务分解情况和各任务之间的逻辑关系图示】中的经费分配比例总和不为100%<br><br>申请书：【项目任务分解情况和各任务之间的逻辑关系图示】中的经费分配比例总和不为100%<br><br>申请书：【项目任务分解情况和各任务之间的逻辑关系图示】中的经费分配比例总和不为100%<br><br>申请书：【项目任务分解情况和各任务之间的逻辑关系图示】中的经费分配比例总和不为100%<br><br>"),
    INPUT_ERROR_9302 ("84019302","预算书：分任务预算的经费合计与【项目任务分解情况和各任务之间的逻辑关系图示】中的经费分配比例不匹配"),
    INPUT_ERROR_9303 ("84019303","申请书：没有找到当年的年度经费概算"),
    INPUT_ERROR_9304 ("84019304","申请书：项目人员的所属研究任务在【项目任务分解情况和各任务之间的逻辑关系图示】中没有找到"),
    // 此部分代码由手工填写 开始

    // ------------------------创新工程输入检查错误定义   结束----------------------------------------
    ;


    /**
     * 错误类型码
     */
    private String code;
    /**
     * 错误类型描述信息
     */
    private String msg;

    SrpmsErrorType(String code, String msg) {
        this.code = code;
        this.msg = msg;
    }

}
